---
type: ViewDrafting
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ViewDrafting

`Autodesk.Revit.DB.ViewDrafting` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2015 | `public static ViewDrafting Create ( Document document , ElementId viewFamilyTypeId )` |
| Method | Print | — | `` |
| Property | Parameter | — | `` |